[
{"asin": "B01M7SEIA6", "text": "Creo que es bueno, simplemente yo tuve que suspenderlo porque me daba dolor de estomago, dejé de tomarlo y se fue el dolor...", "title": "Quería un buen Omega 3", "location_and_date": "Reviewed in the United States on 24 August 2023", "verified": true, "rating": "3.0"},
{"asin": "B01M7SEIA6", "text": "I liked how this product works . Have zero joint pain in my 70 yr old body . How do I know it works ? I ran out and didn’t take my Krill oil for 3 weeks and noticed over joint soreness which I never have . Started taking again and no more pain after taking again .", "title": "Joint supplement", "location_and_date": "Reviewed in the United States on 8 May 2023", "verified": true, "rating": "5.0"},
{"asin": "B01M7SEIA6", "text": "Este aceite lo compro cada cierto tiempo y me funciona bastante bien.", "title": "Excelente", "location_and_date": "Reviewed in the United States on 28 May 2023", "verified": true, "rating": "5.0"},
{"asin": "B01M7SEIA6", "text": "some orders are a little more fishy than others but still OK", "title": "good product", "location_and_date": "Reviewed in the United States on 7 February 2023", "verified": true, "rating": "4.0"},
{"asin": "B01M7SEIA6", "text": "I had stopped taking this for around a year and recently restarted. Highly recommend, I have noticed a difference since restarting it.", "title": "Great supplement", "location_and_date": "Reviewed in the United States on 19 April 2023", "verified": true, "rating": "5.0"},
{"asin": "B01M7SEIA6", "text": "The pills are easy to swallow and don't give me any acid reflux or \"fish burps\".... Make sure you drink a whole glass of water with it. I have been taking this supplement for around 2 months and don't really notice anything but I'm not sure if I'm supposed to notice anything...", "title": "Not really sure yet...", "location_and_date": "Reviewed in the United States on 18 September 2022", "verified": true, "rating": "4.0"},
{"asin": "B01M7SEIA6", "text": "I like this better than regular fish oil!", "title": "Good deal", "location_and_date": "Reviewed in the United States on 22 April 2023", "verified": true, "rating": "5.0"},
{"asin": "B01M7SEIA6", "text": "This product has lowered my total cholesterol, LDL, triglycerides and increased my HDL. Definitely give it a try if you are struggling with high cholesterol.", "title": "Lowered cholesterol", "location_and_date": "Reviewed in the United States on 27 February 2023", "verified": true, "rating": "5.0"},
{"asin": "B01M7SEIA6", "text": "It’s just as described. It’s just really good Krill Oil. I have no complaints about it.", "title": "It’s really good!", "location_and_date": "Reviewed in the United States on 30 November 2022", "verified": true, "rating": "5.0"},
{"asin": "B01M7SEIA6", "text": "Most supplements I really can't tell the difference if they're doing anything beneficial for me or not. I feel like these do make a difference in the appearance of my skin.", "title": "Can tell a difference", "location_and_date": "Reviewed in the United States on 20 September 2022", "verified": true, "rating": "5.0"},
{"asin": "B01M7SEIA6", "text": "REASONABLY PRICED", "title": "PLEASED", "location_and_date": "Reviewed in the United States on 23 December 2022", "verified": true, "rating": "5.0"},
{"asin": "B01M7SEIA6", "text": "These are my favorite fish oil supplements", "title": "Best Omega 3 Source", "location_and_date": "Reviewed in the United States on 14 October 2022", "verified": true, "rating": "5.0"},
{"asin": "B01M7SEIA6", "text": "These are great. I like them because I am post partum. And because they help with my various joint issues. I advise you bvb take with food, though. Not just because they say to, but because if the strawberry capsule flavor doesn't make you wanna gag, the overwhelming fussiness will. I wish they weren't flavored at all, honestly, as it doesn't cover or reduce the fussiness, just adds to the mess", "title": "Fishy fruit", "location_and_date": "Reviewed in the United States on 12 January 2021", "verified": true, "rating": "4.0"},
{"asin": "B01M7SEIA6", "text": "Loved that pill was small and easy to swallow with no after taste.", "title": "Easy to Swallow", "location_and_date": "Reviewed in the United States on 20 September 2022", "verified": true, "rating": "5.0"},
{"asin": "B01M7SEIA6", "text": "Easy to take and much more effective than fish oil", "title": "100 time better and more effective than fish oil capsules", "location_and_date": "Reviewed in the United States on 1 October 2022", "verified": true, "rating": "5.0"},
{"asin": "B01M7SEIA6", "text": "It's hard to rate products like this because it's hard to say if they really work or not sometimes. I got this product because I'm on my feet, constantly moving at work with a lot of stress on my body. Overall, I would say I think this product helps with keeping up with the pain in my neck, and shoulders. But sometimes the pain in those areas become so bad and I need a pain killer to move on, now I would say that has become less since I have been taken these every morning which is a plus. But Ill probably try a different brand and see if anything changes but it could just be me.", "title": "Going to explore around but this product was fine.", "location_and_date": "Reviewed in the United States on 4 August 2019", "verified": true, "rating": "4.0"},
{"asin": "B01M7SEIA6", "text": "These seem to be a really good quality Krill oil. I did not rate the pain relief as I have not noticed any decrease or increase in pain levels. I am taking them because of their purported great cardiovascular benefits. Hope that is true!", "title": "Easy to Swallow, No Flavor", "location_and_date": "Reviewed in the United States on 24 February 2022", "verified": true, "rating": "5.0"},
{"asin": "B01M7SEIA6", "text": "Amazing product. I train in the gym and between pressing and pulling exercises in high frequency or high intensity it adds a lot of sheer force to my elbow joints. About three weeks ago both elbows were feeling pain (not tennis not golfer’s elbow), after 6 days of taking this product, both elbows feel about 95%, very very slight pain but nothing at all worrying.I’ve become a lifetime fan!", "title": "This product is amazing for joint pain! Relief in days!", "location_and_date": "Reviewed in the United States on 1 May 2021", "verified": true, "rating": "5.0"},
{"asin": "B01M7SEIA6", "text": "I’m taking so long this krill oil. My Dr told me to really good . Krill oil has shown to have beneficial effects related to heart health, such as lowering fasting triglyceride levels which are a risk factor for heart disease.", "title": "Good product", "location_and_date": "Reviewed in the United States on 9 March 2022", "verified": true, "rating": "5.0"},
{"asin": "B01M7SEIA6", "text": "I researched for a while and I'm glad that I went with this product. I couldn't take the stairs at work due to pain in my knees and hips that had begun about a month before. I took two of these tiny capsules and I kid you not, within a week and a half I have back the elevator key.I am two thirds through the bottle and I'm happy to report that I'm not experiencing any adverse effects and I'm ready to walk all over Italy.I keep a photo of the bottle because I've recommended it to others.", "title": "Thankful I found this...", "location_and_date": "Reviewed in the United States on 15 May 2019", "verified": true, "rating": "5.0"},
{"asin": "B01M7SEIA6", "text": "Received yesterday.  The good:  Contrary to other reviews, there was no smell and the taste was not fishy.  The surprise:  From reading label on bottle I thought the capsules were 1000 MG, they are not.  The capsules are actually 500 MG and directions indicate you should take two a day.  The label on bottle is misleading; I thought I was receiving a 180 day supply when actually it is a 90 day supply.", "title": "No Smell, 500 MG Capsules", "location_and_date": "Reviewed in the United States on 20 September 2018", "verified": true, "rating": "4.0"},
{"asin": "B01M7SEIA6", "text": "Easy to swallow so I will give it a week or so to see if it works or not", "title": "Just started taking it don’t know if it will work.", "location_and_date": "Reviewed in the United States on 28 May 2022", "verified": true, "rating": "3.0"},
{"asin": "B01M7SEIA6", "text": "I write this review to serve as a warning to anyone that's looking for a good krill oil to avoid this one like the plague. This krill oil has given me severe diarrhea for the past ten days. I'm still trying to recover from it. Not only were there the usual problems associated with diarrhea but also the sleepless nights from the constant stomach ache with bathroom sessions lasting an hour and a half. I should be totally clear of it in about another week. Don't think I tried to get back to normal without medicine. I've been using Imodium  and it is working. I thought it might be just me so my girlfriend, who is an RN, tried it once and started having gas problems. So it's not just me. I do not wish this on anyone else. Please heed this warning and try a different brand. I usually don't like writing bad reviews but I like helping people more. Please, stay away at all costs.", "title": "I am living through the worst case of DIARRHEA I have ever had in my life.", "location_and_date": "Reviewed in the United States on 9 September 2022", "verified": true, "rating": "1.0"},
{"asin": "B01M7SEIA6", "text": "I have been taking Krill oil for several years now.  The quality and effects are much better than plain fish oil.  I recommend this to anyone who is having problems with regular fish oil.", "title": "Been using for several years now.", "location_and_date": "Reviewed in the United States on 22 August 2021", "verified": true, "rating": "5.0"},
{"asin": "B01M7SEIA6", "text": "These are not for pain relief , have no flavor, two questions that required stars. What they are good for is providing 1000 mg of Omega 3 and I feel the benefits everyday as I am no longer on Cholesterol medication, and I feel my heart is greatly improved by this product. I have taken control of my own health and feel better for doing it. This product is an important ingredient in my quest to not be a slave to numerous prescriptions.", "title": "Great benefits from this small capsule!", "location_and_date": "Reviewed in the United States on 3 August 2019", "verified": true, "rating": "5.0"},
{"asin": "B01M7SEIA6", "text": "Second time I am buying this brand.It really works for pre menstrual syndrome, and also as a blood thinner.I realized on it and some quality COQ10 when I had Covid and found out after the window the doctors choose to medicate the patients ( here in Brazil on the first week).It helped with my revovery at home, and without medication.", "title": "Good brand, good quality.", "location_and_date": "Reviewed in the United States on 13 August 2020", "verified": true, "rating": "5.0"},
{"asin": "B01M7SEIA6", "text": "I left a comment some time ago.  I had a question which has since been cleared up.  I am still completely satisfied.  I intend to continue taking them for the purpose of improving my health.  I have a checkup about every 6 months.  I hope to see some improvement over that time.My daughter has been taking fish oil to help with pms and it does, but it often gives her indigestion.  Since we switched to krill oil she has not had indigestion.", "title": "Time will tell", "location_and_date": "Reviewed in the United States on 10 October 2018", "verified": true, "rating": "5.0"},
{"asin": "B01M7SEIA6", "text": "As far as Krill Oil goes this is as good as any other I have tried.", "title": "Average", "location_and_date": "Reviewed in the United States on 2 February 2021", "verified": true, "rating": "4.0"},
{"asin": "B01M7SEIA6", "text": "Pill easy to swallow, reduced the pain in my left hip within days then the pain went away. Take one in the am and one in the PA.", "title": "Does the job!", "location_and_date": "Reviewed in the United States on 31 July 2021", "verified": true, "rating": "5.0"},
{"asin": "B01M7SEIA6", "text": "This is great so much smaller than regular fish oil. Love this. Also add flax and primrose oil to your diet and do your research for fish and shrimp, these days salmon has one of the highest levels of heavy metals if you have chronic pain nausea go problems any kind of tremor get tested for heavy metals it’s a simple blood or hair sample ask your doctor . God bless", "title": "Great small cap", "location_and_date": "Reviewed in the United States on 25 September 2019", "verified": true, "rating": "5.0"}
]