[
{"asin": "B01M7SEIA6", "text": "Creo que es bueno, simplemente yo tuve que suspenderlo porque me daba dolor de estomago, dejé de tomarlo y se fue el dolor...", "title": "Quería un buen Omega 3", "location_and_date": "Reviewed in the United States on 24 August 2023", "verified": true, "rating": "3.0"},
{"asin": "B01M7SEIA6", "text": "I liked how this product works . Have zero joint pain in my 70 yr old body . How do I know it works ? I ran out and didn’t take my Krill oil for 3 weeks and noticed over joint soreness which I never have . Started taking again and no more pain after taking again .", "title": "Joint supplement", "location_and_date": "Reviewed in the United States on 8 May 2023", "verified": true, "rating": "5.0"},
{"asin": "B01M7SEIA6", "text": "Este aceite lo compro cada cierto tiempo y me funciona bastante bien.", "title": "Excelente", "location_and_date": "Reviewed in the United States on 28 May 2023", "verified": true, "rating": "5.0"},
{"asin": "B01M7SEIA6", "text": "some orders are a little more fishy than others but still OK", "title": "good product", "location_and_date": "Reviewed in the United States on 7 February 2023", "verified": true, "rating": "4.0"},
{"asin": "B01M7SEIA6", "text": "I had stopped taking this for around a year and recently restarted. Highly recommend, I have noticed a difference since restarting it.", "title": "Great supplement", "location_and_date": "Reviewed in the United States on 19 April 2023", "verified": true, "rating": "5.0"},
{"asin": "B01M7SEIA6", "text": "The pills are easy to swallow and don't give me any acid reflux or \"fish burps\".... Make sure you drink a whole glass of water with it. I have been taking this supplement for around 2 months and don't really notice anything but I'm not sure if I'm supposed to notice anything...", "title": "Not really sure yet...", "location_and_date": "Reviewed in the United States on 18 September 2022", "verified": true, "rating": "4.0"},
{"asin": "B01M7SEIA6", "text": "I like this better than regular fish oil!", "title": "Good deal", "location_and_date": "Reviewed in the United States on 22 April 2023", "verified": true, "rating": "5.0"},
{"asin": "B01M7SEIA6", "text": "This product has lowered my total cholesterol, LDL, triglycerides and increased my HDL. Definitely give it a try if you are struggling with high cholesterol.", "title": "Lowered cholesterol", "location_and_date": "Reviewed in the United States on 27 February 2023", "verified": true, "rating": "5.0"},
{"asin": "B01M7SEIA6", "text": "It’s just as described. It’s just really good Krill Oil. I have no complaints about it.", "title": "It’s really good!", "location_and_date": "Reviewed in the United States on 30 November 2022", "verified": true, "rating": "5.0"},
{"asin": "B01M7SEIA6", "text": "Most supplements I really can't tell the difference if they're doing anything beneficial for me or not. I feel like these do make a difference in the appearance of my skin.", "title": "Can tell a difference", "location_and_date": "Reviewed in the United States on 20 September 2022", "verified": true, "rating": "5.0"}
]